import { NEW_PROJECT } from '../actions/types';

const initState = {
  projects: [
    {
      id: '1',
      title: 'ผลักดันการลดใช้ถุงพสาสติก',
      content:
        'ถุงพลาสติก มันย่อยสลายยาก ดังนั้นเราควรลดละเลิกการใช้ถุงพลาสติก หันมาใช้ถุงผ้าแทน ซึ่งสามารถนำกลับมาใช้ใหม่ได้'
    },
    {
      id: '2',
      title: 'ผลักดันกฎหมายภาษีที่ดิน และสิ่งปลูกสร้าง',
      content:
        'จุดมุ่งหมายสำคัญของกฎหมายฉบับนี้ ต้องการเก็บภาษีที่ดินที่รกร้างว่างเปล่า ที่ไม่ได้ใช้ประโยชน์เชิงเศรษฐกิจ และถูกดองเอาไว้ใน Land Bank ของเศรษฐี รัฐเข้าไปเก็บภาษี เพื่อเป็นการผลักทางอ้อม ถ้าเศรษฐีไม่อยากเสียภาษี ก็ต้องปล่อยขายที่ดิน เมื่อมีที่ดินในตลาดมากขึ้น ก็ย่อมส่งผลให้ราคาที่ดินลดลง ตามหลัก อุปสงค์ อุปทาน ซึ่งจะช่วยสนับสนุนให้คนชั้นกลางที่มีเงินเก็บ สามารถซื้อที่ดินมาทำประโยชน์เชิงเศรษฐกิจได้ สุดท้ายแล้วจะช่วยเพิ่ม ผลผลิตมวลรวม (GDP) ให้ประเทศ'
    },
    {
      id: '3',
      title: 'ผลักดันเลือกตั้งผู้ว่าฯ',
      content:
        'วิทัศน์ของผู้นำมีส่วนสำคัญอย่างยิ่ง ต่อการเจริญเติบโตของแต่ละองค์กร ถ้าเราอยากให้ประเทศเราโต เราก็ต้องกระจายความเสี่ยง โดยจัดให้มีผู้นำพร้อมกันหลายๆคน เพราะเราไม่รู้เลยว่า เราจะได้นายกฯ ที่มีวิทัศน์ในทุกการเลือกตั้งระดับประเทศ แต่อย่างน้อยถ้าเรามีผู้ว่าฯ จากการเลือกตั้งท้องถิ่น บางจังหวัดที่ได้ผู้ว่าฯ เก่งๆเข้ามา จังหวัดนั้นก็อาจโตได้อย่างมีสาระสำคัญ จนไปช่วยดัน GDP ในระดับประเทศให้ดีขึ้นได้ และที่สำคัญ จำนวนประชากรแฝงในกรุงเทพฯ ก็จะลดลง เพราะแรงงานจะกระจายตัว ไปอยู่ตามจังหวัดต่างๆ ที่มีผู้ว่าฯเก่งๆ'
    }
  ]
};

const projectReducer = (state = initState, action) => {
  switch (action.type) {
    case NEW_PROJECT:
      console.log('action createProject here', action.payload);
      break;

    default:
      break;
  }
  return state;
};

export default projectReducer;
